import { IPage } from "shared/types";

export const MOCK_PAGES: IPage[] = [
  {
    id: 1,
    startDate: 1980,
    endDate: 1986,
    name: 'Наука',
    items: [
      {
        date: 1980,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 1981,
        description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик - GN-z11',
      },
      {
        date: 1982,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        date: 1983,
        description: '23 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 1984,
        description: '33 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 1986,
        description: '43 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
    ],
  },
  {
    id: 2,
    startDate: 1990,
    endDate: 1996,
    name: 'Антинаука',
    items: [
      {
        date: 1990,
        description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик - GN-z11',
      },
      {
        date: 1991,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 1992,
        description: '33 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 1993,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        date: 1994,
        description: '43 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 1996,
        description: '53 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
    ],
  },
  {
    id: 3,
    startDate: 2000,
    endDate: 2006,
    name: 'Косметика',
    items: [
      {
        date: 2000,
        description: '43 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 2001,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 2003,
        description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик - GN-z11',
      },
      {
        date: 2004,
        description: '33 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 2005,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        date: 2006,
        description: '53 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
    ],
  },
  {
    id: 4,
    startDate: 2010,
    endDate: 2015,
    name: 'Технологии',
    items: [
      {
        date: 2010,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        date: 2011,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 2012,
        description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик - GN-z11',
      },
      {
        date: 2013,
        description: '53 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 2015,
        description: '33 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
    ],
  },
  {
    id: 5,
    startDate: 2015,
    endDate: 2022,
    name: 'Экология',
    items: [
      {
        date: 2015,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        date: 2016,
        description: '53 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 2017,
        description: '33 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 2018,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        date: 2021,
        description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик - GN-z11',
      },
      {
        date: 2022,
        description: '43 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
    ],
  },
  {
    id: 6,
    startDate: 2023,
    endDate: 2030,
    name: 'Из будущего',
    items: [
      {
        date: 2023,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        date: 2027,
        description: 'Компания Nikitosha Inc официально представила первый в мире электрический воздух',
      },
      {
        date: 2030,
        description: '53 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
    ],
  },
];